// /*++
// Copyright (c) 2009 Intel Corporation. All rights reserved.
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
// --*/
//
// Name:  Setup.uni
//
// Description: Setup strings
//
//**********************************************************************
/=#
#langdef   zh-Hans "\wide中文\narrow"
#langdef   en-US "English"

#string    STR_EMPTY                     #language en-US ""
                                         #language zh-Hans ""
#string    STR_ENABLED                   #language en-US "Enabled"
                                         #language zh-Hans "\wide打开\narrow"
#string    STR_DISABLED                  #language en-US "Disabled"
                                         #language zh-Hans "\wide关闭\narrow"
#string    STR_NONE                      #language en-US "None"
                                         #language zh-Hans "\wide无\narrow"
#string    STR_AUTO                      #language en-US "Auto"
//                                         #language zh-Hans "\wide语言\narrow"
//
// Main
//
#string STR_MAIN                        #language en-US "Main"
                                        #language zh-Hans "\wide主菜单\narrow"
#string STR_MAIN_HELP                   #language en-US "System Overview"
                                        #language zh-Hans "System Overview"
#string STR_LANGUAGE_HELP               #language en-US "Choose the system default language."
                                        #language zh-Hans "Choose the system default language."
#string STR_LANGUAGE_PROMPT             #language en-US "System Language"
                                        #language zh-Hans  "\wide系统语言\narrow"
#string STR_BIOS                        #language en-US "BIOS Information"
                                        #language zh-Hans "BIOS Information"
#string STR_BIOS_VENDOR_NAME            #language en-US "BIOS Vendor"
                                        #language zh-Hans "BIOS Vendor"
#string STR_BIOS_VENDOR_VALUE           #language en-US "N/A" //dynamically updated
                                        #language zh-Hans "N/A" //dynamically updated
#string STR_BIOS_CORE_VERSION_NAME      #language en-US "Core Version"
                                        #language zh-Hans "Core Version"
#string STR_BIOS_CORE_VERSION_VALUE     #language en-US "N/A" //dynamically updated
                                        #language zh-Hans "N/A" //dynamically updated
#string STR_BIOS_VERSION_NAME           #language en-US "BIOS Version"
                                        #language zh-Hans "BIOS Version"
#string STR_BIOS_VERSION_VALUE          #language en-US "N/A" //dynamically updated
                                        #language zh-Hans "N/A" //dynamically updated
#string STR_BIOS_DATE_NAME              #language en-US "Build Date"
                                        #language zh-Hans "Build Date"
#string STR_BIOS_DATE_VALUE             #language en-US "N/A" //dynamically updated
                                        #language zh-Hans "N/A" //dynamically updated
#string STR_DATE                        #language en-US "System Date(MM/DD/YYYY)"
                                        #language zh-Hans "\wide系统日期（月：日：年）\narrow"
#string STR_DATE_HELP                   #language en-US "Set the Date. Use Tab key to switch between Date fields."
                                        #language zh-Hans "\wide设定日期. 使用\narrowTab\wide键可以在日期区域切换.\narrow"
#string STR_TIME                        #language en-US "System Time(HH:MM:SS)"
                                        #language zh-Hans "\wide系统时间（时：分：秒）\narrow"
#string STR_TIME_HELP                   #language en-US "Set the Time. Use Tab key to switch between Time fields."
                                        #language zh-Hans "\wide设定时间. 使用\narrowTab\wide键可以在时间区域切换.\narrow"
#string STR_ACCESS_LEVEL                #language en-US "User Access Level"
                                        #language zh-Hans "User Access Level"
#string STR_ACCESS_USER                 #language en-US "User"
                                        #language zh-Hans "User"
#string STR_ACCESS_ADMIN                #language en-US "Administrator"
                                        #language zh-Hans "Administrator"
#string STR_ACCESS_CUSTOMER             #language en-US "Accessing Customer"
                                        #language zh-Hans "Accessing Customer"
#string STR_REQUIRE_ADMIN_PSW           #language en-US "Require Admin. Pass. when Flashing"
                                        #language zh-Hans "\wide当刷新\narrowBIOS\wide提示输入管理员密码\narrow"
#string STR_REQUIRE_ADMIN_PSW_HELP      #language en-US "If "No" is selected, the Administrator Password will not be required when updating the system software."
                                        #language zh-Hans "\wide选择"否"时。刷新\narrowBIOS\wide时不需要输入管理员密码.\narrow"
#string STR_CFG_CHANGE_DETECT           #language en-US "Configuration Change Detection"
                                        #language zh-Hans "\wide配置改变检查\narrow"
#string STR_CFG_CHANGE_DETECT_HELP      #language en-US "If it is enabled, when a device is installed or removed, the system will notify the user during POST. This notice can only be cleared by entering BIOS setup, saving and then exiting."
                                        #language zh-Hans "\wide选择是否打开配置改变检查功能. 如果打开，当某个设备被安装或者移除, 系统会在POST时告知用户.这个消息用户只能通过进入BIOS设定保存退出清除.\narrow"

#string STR_SYSTEM_TIME_AND_DATE        #language en-US "Systme Time & Date"
                                        #language zh-Hans "\wide系统时间和日期\narrow"
#string STR_MACHINE_TYPE_MODEL_NAME     #language en-US "Machine Type and Model"
                                        #language zh-Hans "\wide主机型号和编码\narrow"
#string STR_MACHINE_TYPE_MODEL_VALUE    #language en-US "N/A"
#string STR_SYSTEM_BRAND_ID_NAME        #language en-US "System Brand ID"
                                        #language zh-Hans "\wide主机商标标识\narrow"
#string STR_SYSTEM_BRAND_ID_VALUE       #language en-US "N/A"
#string STR_SYSTEM_SERIAL_NUMBER_NAME   #language en-US "System Serial Number"
                                        #language zh-Hans "\wide主机编号\narrow"
#string STR_SYSTEM_SERIAL_NUMBER_VALUE  #language en-US "N/A"
#string STR_ASSET_TAG_NAME              #language en-US "Asset Tag"
                                        #language zh-Hans "\wide资产管理名称\narrow"
#string STR_ASSET_TAG_VALUE             #language en-US "N/A"
#string STR_SYSTEM_UUID_NAME            #language en-US "System UUID"
                                        #language zh-Hans "\wide系统UUID\narrow"
#string STR_SYSTEM_UUID_VALUE           #language en-US "N/A"
#string STR_ETHERNET_MAC_ADDR_NAME      #language en-US "Ethernet MAC Address"
                                        #language zh-Hans "\wide以太网卡物理地址\narrow"
#string STR_ETHERNET_MAC_ADDR_VALUE     #language en-US "Not Available"
#string STR_BIOS_REVISION_LEVEL_NAME    #language en-US "BIOS Revision Level"
                                        #language zh-Hans "BIOS\wide版本信息\narrow"
#string STR_BIOS_REVISION_LEVEL_VALUE   #language en-US "N/A"
#string STR_BOOTLOCK_REVISION_LEVEL_NAME      #language en-US "Boot Block Revision Level"
                                              #language zh-Hans "Bootblock\wide信息\narrow"
#string STR_BOOTLOCK_REVISION_LEVEL_VALUE     #language en-US "N/A"
                                              #language zh-Hans "N/A"
                                              
#string STR_BIOS_DATE_NAME              #language en-US "BIOS Date"
                                        #language zh-Hans "BIOS\wide生成日期\narrow"
                                        
#string STR_BIOS_DATE_VALUE             #language en-US "N/A"
                                        #language zh-Hans "N/A"

#string STR_LANGUAGE                    #language en-US "Language"
                                        #language zh-Hans "\wide语言\narrow"
#string STR_LANGUAGE_ENGLISH            #language en-US "English"
#string STR_LANGUAGE_CHINESE            #language en-US "Chinese"
                                        #language zh-Hans "\wide中文\narrow"

// Advanced
#string STR_ADVANCED                    #language en-US "Advanced"
#string STR_ADVANCED_HELP               #language en-US "Advanced Menu Settings"

// Devices
#string STR_DEVICES                     #language en-US "Devices"
#string STR_DEVICES_HELP                #language en-US "Devices Settings"


// Security
#string STR_SECURITY                    #language en-US "Security"
                                        #language zh-Hans "\wide安全\narrow"
#string STR_SECURITY_HELP               #language en-US "Security Settings"
                                        #language zh-Hans "\wide安全配置\narrow"
#string STR_SECURITY_BANNER_ONE         #language en-US "Password Description"
                                        #language zh-Hans "Password Description"
#string STR_SECURITY_BANNER_TWO         #language en-US "Administrator's password and User's password all"
                                        #language zh-Hans "Administrator's password and User's password all"
#string STR_SECURITY_BANNER_THREE       #language en-US "can enter setup and OS,but Administrator's password"
                                        #language zh-Hans "can enter setup and OS,but Administrator's password"
#string STR_SECURITY_BANNER_FOUR        #language en-US "control the behavior of User's,for example,"
                                        #language zh-Hans "control the behavior of User's,for example,"
#string STR_SECURITY_BANNER_FIVE        #language en-US "Access level and Clear password."
                                        #language zh-Hans "Access level and Clear password."
#string STR_ADMIN_PASSWORD              #language en-US "Administrator Password"
                                        #language zh-Hans "Administrator Password"
#string STR_CLEAR_USER_PASSWORD         #language en-US "Clear User Password"
                                        #language zh-Hans "Clear User Password"
#string STR_CLEAR_USER_PASSWORD_HELP    #language en-US "Set User Password to Empty."
                                        #language zh-Hans "Set User Password to Empty."
#string STR_SET_ADMIN_PASSWORD          #language en-US "Set Administrator Password"
                                        #language zh-Hans "Set Administrator Password"
#string STR_ADMIN_PASSWORD_HELP         #language en-US "Set Setup Administrator Password,Password must be 6 to 20 alpha numeric characters,Default password is Empty.When Set Admi password,User Access Level can also be changed."
                                        #language zh-Hans "Set Setup Administrator Password,Password must be 6 to 20 alpha numeric characters,Default password is Empty.When Set Admi password,User Access Level can also be changed."
#string STR_USER_PASSWORD               #language en-US "User Password"
                                        #language zh-Hans "User Password"
#string STR_SET_USER_PASSWORD           #language en-US "Set User Password"
                                        #language zh-Hans "Set User Password"
#string STR_USER_PASSWORD_HELP          #language en-US "Set User Password,Password must be 6 to 20 alpha numeric characters,Default password is Empty."
                                        #language zh-Hans "Set User Password,Password must be 6 to 20 alpha numeric characters,Default password is Empty."
#string STR_PASSWORD_INSTALLED          #language en-US "Installed"
#string STR_PASSWORD_UNINSTALLED        #language en-US "Uninstalled"
#string STR_PASSWORD_ACCESS_LIMITED     #language en-US "Limited Access"
#string STR_PASSWORD_ACCESS_FULL        #language en-US "Full Access"
#string STR_PASSWORD_ACCESS_NO          #language en-US "No Access"
#string STR_SETUP_HDD_PASSWORD_CONFIG   #language en-US "Hard Disk Password"
#string STR_SETUP_HDD_PASSWORD_CONFIG_HELP   #language en-US   "Configure hard disk password."
#string STR_SETUP_SECUREBOOT_TITLE      #language en-US "Secure Boot Configuration"
#string STR_SETUP_TPM_CONFIG            #language en-US "TPM1.2"
#string STR_SETUP_TPM2_CONFIG           #language en-US "TPM2"
#string STR_SETUP_TCM_CONFIG            #language en-US "TCM"
#string STR_SETUP_TC_CONFIG             #language en-US "Trust Compute Config"

// Exit
#string STR_EXIT                        #language en-US "Exit"
#string STR_EXIT_HELP                   #language en-US "Exit Options"
#string STR_SAVE_EXIT                   #language en-US "Save Changes and Exit"
#string STR_SAVE_EXIT_HELP              #language en-US "Exit system Setup after saving the changes."
#string STR_DISCARD_EXIT                #language en-US "Discard Changes and Exit"
#string STR_DISCARD_EXIT_HELP           #language en-US "Exit system Setup without saving any changes."
#string STR_RESTORE_DEFAULTS            #language en-US "Load Optimal Defaults"
#string STR_RESTORE_DEFAULTS_HELP       #language en-US "Restore/Load defaults values for all the Setup options."


// Reset
#string STR_RESET                       #language en-US "Reset"
#string STR_RESET_HELP                  #language en-US "Reset System"
#string RESET_MAIN                      #language en-US "Reset"
#string STR_STANDARD_DEFAULT_PROMPT     #language en-US "Standard Default"
#string STR_MANUFACTURE_DEFAULT_PROMPT  #language en-US "Manufacture Default"
#string STR_SYSTEM_SUMMARY              #language en-US "System Summary"
#string STR_PROCESSOR_TYPE              #language en-US "Processor Type"
#string STR_MAIN_LANGUAGE_SELECT        #language en-US  "Select Language"
#string STR_MAIN_LANGUAGE_SELECT_HELP   #language en-US  "This is the option one adjusts to change the language for the current system"
#string STR_CLEAR_EVENT_LOG_WARNING     #language en-US  "  All system event log will be cleared immediately!"
#string STR_WARNING_TITLE               #language en-US  "Setup Warning"

                                        
#string STR_SECUREBOOT_TITLE            #language en-US "Secure Boot"
#string STR_SECUREBOOT_HELP             #language en-US ""                                        
#string STR_TXT_CONFIG             #language en-US "TXT Configuration"  
#string STR_TXT             #language en-US "TXT"  
#string STR_TXT_HELP             #language en-US "enable/disable TXT"  
